#+hugo_base_dir: /Users/develop/blog/
#+hugo_section: post
#+hugo_auto_set_lastmod: t
#+hugo_custom_front_matter: :toc true
#+hugo_code_fence: nil
#+STARTUP: logdrawer
#+startup: overview
#+OPTIONS: author:nil
#+OPTIONS: \n:t



***** *我们可以使用括号将表达式分组在双括号内*,分组的原因之一可能是更容易阅读表达式
#+begin_src bash
  [[ 3 -eq 3 && (2 -eq 2 && 1 -eq 1) ]] && echo "Parentheses can be used"
#+end_src

#+RESULTS:
: Parentheses can be used

**** 命令替换有两种方式:
- 反引号
- $()

反引号和$()的作用相同,用于命令替换,即完成引用命令的执行,
将其结果替换出来,与变量替换差不多.(简单说就是先运行里面的命令)

#+begin_src bash
  echo `date  +%Y-%m-%d-%H`
  #或
  echo $(date +%Y-%m-%d-%H)
#+end_src

#+RESULTS:
| 2024-05-22-15 |
| 2024-05-22-15 |

在shell脚本中建议使用$(),原因主要有两个:
- (1) 反引号与单引号外形相似,容易混淆.
- (2) 在多层次的符合替换中,内层反引号需要转义,而$()比较直观.

**** 2.1直接变量替换
一般情况下,$var与${var}并没有区别,但用${}会比较精确的界定变量名的名称范围,
比方说:
#+begin_src bash
  AB="I am AB"
  A="dablelv"
  echo $AB
#+end_src

#+RESULTS:
: I am AB

原本是打算先将$A的结果替换出来,然后再补一个B字母于其后,但在命令行上,
真正的结果却是只会替换变量名称为AB的值.若使用${}就没有问题了.
#+begin_src bash
  AB="I am AB"
  A="dablelv"
  echo ${A}B
#+end_src

#+RESULTS:
: dablelvB

**** 2.2特殊变量替换
${}除了直接替换变量内容,还有一些字符串变量的特殊功能.
假设我们定义了一个字符串变量为:
#+begin_src bash
  file='/dir1/dir2/dir3/my.file.txt'
#+end_src

- 字符串提取
  字符串提取可以使用${:}和${::}.
  1. ${var:n}
     若n为正数,n从0开始,表示在变量var中提取第n个字符到末尾的所有
     字符.若n为负数,提取字符串最后面n的绝对值个字符,使用时在冒号
     后面加空格或一个算术表达式或整个num加上括号,如${var: -2},
     ${var:1-3}或${var:(-2)}均表示提取最后两个字符.
     #+begin_src bash
       file='/dir1/dir2/dir3/my.file.txt'
       # 提取第一个字符及其后面的所有字符:
       # dir1/dir2/dir3/my.file.txt
       echo ${file:1}
       # 提取最后3个字符,注意冒号后面添加一个空格:txt
       echo ${file: -3}
       # 提取最后3个字符,冒号后米娜不需要添加空格:txt
       echo ${file:1-4}
       # 提取最后3个字符,冒号后面不需要添加空格:txt
       echo ${file:(-3)}
     #+end_src

     #+RESULTS:
     | dir1/dir2/dir3/my.file.txt |
     | txt                        |
     | txt                        |
     | txt                        |

  2. ${var:n1:n2}
     ${var:n1:n2}用于提取下标n1开始后面n2个字符,其中下标n1与n2
     从0开始.如果长度n2为0,结果为空.
     #+begin_src bash
       file='/dir1/dir2/dir3/my.file.txt'
       # 提取最左边的5个字符
       echo ${file:0:5}
       # 提取从第5个字符开始右边的连续5个字符:/dir2
       echo ${file:5:5}
     #+end_src

     #+RESULTS:
     | /dir1 |
     | /dir2 |

- 字符串替换
  ${var/pattern/pattern}表示将var字符串第一个匹配的pattern替换为
  另一个pattern.不改变原有变量.
  #+begin_src bash
    file='/dir1/dir2/dir3/my.file.txt'
    # 将第一个dir替换为path: /path1/dir2/dir3/my.file.txt
    echo ${file/dir/path}
    # 将全部dir替换为path:/path1/path2/path3/my.file.txt
    echo ${file//dir/path}
  #+end_src

  #+RESULTS:
  | /path1/dir2/dir3/my.file.txt   |
  | /path1/path2/path3/my.file.txt |

- 字符串截断
  可以过滤掉符合指定规则的字符串,不改变源变量
  #+begin_src bash
    file='/dir1/dir2/dir3/my.file.txt'
    # 拿掉第一个/及其左边的字符串:dir1/dir2/dir3/my.file.txt
    echo ${file#*/}
    # 拿掉最后一个/及其左边字符串:my.file.txt
    echo ${file##*/}
    # 拿掉最后一个/及其右边的字符串:/dir1/dir2/dir3
    echo ${file%/*}
    # 拿掉第一个/及其右边的字符串:空串
    ${file%%/*}
  #+end_src 

  #+RESULTS:
  | dir1/dir2/dir3/my.file.txt |
  | my.file.txt                |
  | /dir1/dir2/dir3            |

  记忆方法为:
  1) #去掉左边,在键盘上#在%左边

  2) %去掉右边,在键盘上%在#右边

  3) 一个符号是最小匹配,两个符号是最大匹配
